Revit 2027 API
ParameterTypeId.CeilingStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CeilingStructureIdParam { get; }
Public Shared ReadOnly Property CeilingStructureIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CeilingStructureIdParam {
	ForgeTypeId^ get ();
}
static member CeilingStructureIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace